import React, { useEffect, useState } from 'react'
import Styles from './TimetablePage.module.css'

export const TimetablePage = () => {
    const [current, setCurrent] = useState('1а')

    useEffect(() => {
        window.scrollTo(0,0);
        return () => {
            window.scrollTo(0,0);
        }
    })

    const classes = [
        { name: '1а' },
        { name: '1б' },
        { name: '2' },
        { name: '3' },
        { name: '4' },
        { name: '5' },
        { name: '6' },
        { name: '7' },
        { name: '8' },
        { name: '9' },
        { name: '10' },
        { name: '11' }
    ]

    const days = [
        '', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт'
    ]
    
    const timetable = [
        { klass: '1а', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Математика', 'Кырг-яз', 'Англ-яз', 'Письмо', 'Этика'] },
            { text: '10:45-11:25', lessons: ['Англ.яз', 'Письмо', 'Письмо', 'Таэквондо', 'Англ-яз'] },
            { text: '11:30-12:10', lessons: ['Хореграфия', 'Плавание', 'Музыка', 'Кырг-яз', 'Плавание'] },
            { text: '12:15-12:55', lessons: ['Письмо', 'Плавание', 'Чтение', 'Чтение', 'Плавание'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Хор', 'ИХТ', 'ОБЖ', 'Хореграфия', 'Кырг-яз'] },
            { text: '14:10-14:50', lessons: ['Хор', 'Родиноведение', 'ВДР', 'ВДР', 'ВДР'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Чтение', 'ВДР', 'Хор', 'ВДР', 'ВДР'] },
            { text: '15:45-16:30', lessons: ['ВДР', 'ВДР', 'Хор', 'ВДР', 'ВДР'] },
        ] },
        { klass: '1б', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '2', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '3', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '4', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '5', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '6', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '7', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '8', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '9', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '10', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
        { klass: '11', timetable: [
            { text: '09:00-09:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Завтрак', width: '100%' },
            { text: '10:00-10:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '10:45-11:25', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '11:30-12:10', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '12:15-12:55', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Обед', width: '100%' },
            { text: '13:25-14:05', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '14:10-14:50', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: 'Полдник', width: '100%' },
            { text: '15:00-15:40', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
            { text: '15:45-16:30', lessons: ['Ритмика', 'Таэквондо', 'Математика', 'Математика', 'Математика'] },
        ] },
    ]

    return (
        <div className={Styles.timetable}>
            <div className="container">
                <h3 className={Styles.heading}>Расписание</h3>
                <div className={Styles.tabs}>
                    {
                        classes.map(({ name }, i) => {
                            return (
                                <div onClick={() => setCurrent(name)} key={ i } className={Styles.tab}>
                                    { name } класс
                                </div>
                            )
                        })
                    }
                </div>
                <div className={Styles.title}>
                    {
                        timetable.filter(el => el.klass === current).map(({ klass }, i) => {
                            return <h3 key={ i } className={Styles.class}>{klass} класс</h3>
                        })
                    }
                </div>
                <div className={Styles.block}>
                    <div className={Styles.row}>
                        {
                            days.map((el, i) => {
                                return (
                                    <div key={ i } className={Styles.top}>{ el }</div>
                                )
                            })
                        }
                    </div>
                    {
                        timetable.filter(el => el.klass === current).map(({ klass, timetable }) => {
                            return timetable.map(({ text, lessons, width }, i) => {
                                return (
                                    <div key={ i } className={Styles.row} style={{gridTemplateColumns: width}}>
                                        <div className={Styles.left}>{ text }</div>
                                        {
                                            lessons ?
                                            lessons.map((el, i) => {
                                                return <div key={ i } className={Styles.item}>{el}</div>
                                            }) : ''
                                        }
                                    </div>
                                )
                            })
                        })
                    }
                </div>
            </div>
        </div>
    )
}
